app/Models/ProgramModel.php

    public function updateDetailsModel($data, $id)
    {
        // print_r($data);
        // print_r($id);
        // die;

        $query = $this->db->table('projectci4.programme_info');
        $query->where('prog_id', $id);
        $query->update($data);
---
UPDATE `projectci4`.`programme_info` SET `progTitle` = 'demo3 sandeep', `targetGroup` = 'TG-1', `date` = '2024-12-08', `progDirector` = 'PD-2', `dealingAsstt` = 'DA-3', `materialLink` = 'prog_id', `paymentdone` = 'no'
WHERE `prog_id` = '119'