app/Models/ProgramModel.php

    public function updateDetailsModel($data, $id)
    {
        // print_r($data);
        // print_r($id);
        // die;

        $query = $this->db->table('projectci4.programme_info');
        $query->where('prog_id', $id);
        $query->update($data);
---
UPDATE `projectci4`.`programme_info` SET `progPdf` = 'Gmail - Cyber Police Complaint No. 22210240000373- Details_Action Required by Branch – URGENT - Classification.pdf by abdul sameer', `attendancePdf` = 'Rashid-resume.pdf by abdul sameer'
WHERE `prog_id` = '415'